---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ArrowType
source: html/8f555cd2-52dc-e3a4-e203-bf83457f5ed8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ArrowType Property

"Arrow Style"

## Syntax (C#)
```csharp
public static ForgeTypeId ArrowType { get; }
```